---
title: AssetProperties
classe: Autodesk.Revit.DB.Visual.AssetProperties
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# AssetProperties

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AssetProperty Item { get; }` | `assetProperties.Item` | AssetProperty |
| `Int32 Size { get; }` | `assetProperties.Size` | Int32 |
| `AssetProperty FindByName(String)` | `assetProperties.FindByName(name)` | AssetProperty |
| `AssetProperty Get(Int32)` | `assetProperties.Get(index)` | AssetProperty |
| `Boolean IsValidIndex(Int32)` | `assetProperties.IsValidIndex(index)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```